Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: ཉན་ཐོས་དང་།
en: “I also perceive the successive accumulations for the first development of the aspiration to enlightenment by those tathāgatas, and so on.

source: རང་སངས་རྒྱས་ཐམས་ཅད་དང་།
en: “I know and comprehend the unbroken, unceasing succession of the buddhas.

source: དེའི་ཡུལ་ལ་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱིས་མི་འཕྲོགས་པ་ཤེས་ཤིང་ཁོང་དུ་ཆུད་པར་བྱེད་དོ། །
en: It is unequaled; it is known through faith, is known through the diligence and resolve of bodhisattvas, augments the power of the diligence of bodhisattvas, and cannot be overcome by the entire world, by all śrāvakas and pratyeka­buddhas, or by bodhisattvas who have not entered its scope.

source: རྣམ་པར་སྣང་མཛད་ལ་སྩོགས་པ་ད་ལྟར་བྱུང་བའི་དེ་བཞིན་གཤེགས་པ་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ན་བཞུགས་པ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་ཐམས་ཅད་ཀྱང་མཐོང་ཞིང་ཤེས་ཏེ།
en: “I see and know the succession of the present tathāgatas that reside in world realms in the ten directions, such as Vairocana.

source: སེམས་ཀྱི་སྐད་ཅིག་གཅིག་ལ་སངས་རྒྱས་བརྒྱ་ཡང་མཐོང་ཞིང་ཤེས་སོ། །དེའི་འོག་མའི་སེམས་ཀྱིས་སངས་རྒྱས་སྟོང་ཡང་མཐོང་བ་ནས།
en: “I see a hundred buddhas in one instant of mind.

source: དེའི་འོག་མའི་སེམས་ཀྱིས་དེ་བཞིན་གཤེགས་པ་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་བར་དུ་ཡང་མཐོང་སྟེ།
en: In the next instant of mind I perceive a thousand buddhas, and so on, up to the instant of mind in which I see tathāgatas as numerous as the atoms in an inexpressible number of inexpressible numbers of buddha realms.

source: ནམ་དེ་བཞིན་གཤེགས་པ་གང་གི་ཞལ་བལྟ་བར་དགའ་བ་དེའི་ཚེ་འང་དེ་བཞིན་དུ་མཐོང་སྟེ།
en: “When I wish to see a certain tathāgata, I see him.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གིས་བསྟན་པ་དང་། བསྟན་པ་མཛད་པ་དང་། བསྟན་པར་འགྱུར་བ་དེ་དག་ཀྱང་ཐོས་སོ། །
en: I hear all that has been taught, is being taught, and will be taught by those buddhas, those bhagavats.

source: ཐོས་ནས་ཀྱང་འཛིན་ཏོ། །
en: When I have heard them, I retain them.

source: ཤེས་རབ་ཀྱིས་སྣང་བར་བྱེད་དོ། །རིགས་ཀྱི་བུ་ཁོ་བོས་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པར་ཐར་པ་ཡོངས་སུ་མྱ་ངན་ལས་མི་འདའ་བའི་མཐར་ཕྱིན་པ་འདི་ཤེས་བར་ཟད་ན།
en: With my wisdom I illuminate them.

source: ཁོ་བོས་བྱང་ཆུབ་སེམས་དཔའ་དུས་གསུམ་སྐད་ཅིག་གཅིག་ཏུ་ཤེས་པ་རབ་ཏུ་ཐོབ་པ། སྐད་ཅིག་གཅིག་གི་ཆ་ཤས་ལ་ཏིང་ངེ་འཛིན་རྣམ་པར་ཕྱེ་བ་ལ་སྤྱད་པ། དེ་བཞིན་གཤེགས་པའི་ཉི་མ་ལས་བྱུང་བ་རྟོག་པ་དང་། རྣམ་པར་རྟོག་པ་ཐམས་ཅད་མཉམ་པ་ཉིད་དུ་ཁོང་དུ་ཆུད་པ། སངས་རྒྱས་ཐམས་ཅད་དང་མཉམ་པའི་ཏིང་ངེ་འཛིན་རྗེས་སུ་རྟོགས་པ། བདག་དང་སེམས་ཅན་དང་། སངས་རྒྱས་མི་གཉིས་པར་སྤྱོད་པ། རང་བཞིན་གྱིས་འོད་གསལ་བའི་ཆོས་ཀྱི་རྒྱན་གྱི་དཀྱིལ་འཁོར་དང་ལྡན་པ། ཡེ་ཤེས་ཀྱི་འཁྲུལ་འཁོར་ཀྱིས་འཇིག་རྟེན་གྱི་དྲ་བ་འགེངས་པ། དེ་བཞིན་གཤེགས་པ་རྒྱ་མཚོ་ཐམས་ཅད་དང་།
en: “Noble one, I know this bodhisattva liberation called the attainment of the summit of inexhaustibility, but how could I know the conduct or describe the qualities of the bodhisattvas who know the three times in a single instant; who in one fraction of an instant of their practice dwell in an array of samādhis; who have entered into the sunlight of the tathāgatas; who understand the equality of all concepts and misconceptions; who have realized the samādhi that is equal to that of all the buddhas; who act in the nonduality of self, beings, and buddhas; who are in the domain of the display of the Dharma of natural luminosity; who have cut through the net of the world with the device of wisdom; who act without disturbing the seal of the Dharma of the tathāgatas; who have the scope of wisdom that understands the entire realm of phenomena; who have the scope of wisdom that understands the Dharma teaching of all the tathāgatas?

source: མི་འགལ་བར་རྣམ་པར་སྤྱོད་པ། ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་དུ་རྣམ་པར་རྟོགས་པར་བྱེད་པའི་ཡེ་ཤེས་ཀྱི་ཡུལ་དང་ལྡན་པ། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཆོས་བསྟན་པ་རྣམ་པར་རིག་པར་བྱེད་པའི་ཡེ་ཤེས་ཀྱི་ཡུལ་ཅན་དེ་དག་གི་སྤྱོད་པ་ཤེས་པའམ།
en: “Depart, noble one.

source: ཡོན་ཏན་བརྗོད་པར་ནུས་རེ་སྐན། །སོང་རིགས་ཀྱི་བུ་ལྷོ་ཕྱོགས་ཀྱི་རྒྱུད་འདི་ཉིད་ན་རི་གྲུ་འཛིན་ཅེས་བྱ་བ་ཡོད་དེ།
en: In this southern region, there is the mountain named Potalaka.

source: དེ་ན་བྱང་ཆུབ་སེམས་དཔའ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་ཞེས་བྱ་བ་འདུག་གིས།
en: There dwells the bodhisattva by the name of Avalokiteśvara.

source: ཇི་ལྟར་ནན་ཏན་དུ་བགྱི་བ་དྲིས་ཤིག་ཅེས་ནས་དེའི་ཚེ།
en: How should a bodhisattva practice it?’ ”

source: ཚིགས་སུ་བཅད་པ་འདི་གཉིས་སྨྲས་སོ། །སོང་ཤིག་ནོར་བཟངས་དཔལ་གྱི་ཆུ་རྒྱལ་དཔུང་ཞིག་ན། །
en: Then he spoke these two verses: “Depart, Sudhana!

source: མཁས་པ་རྣམས་ཀྱིས་རི་རྒྱལ་གྲུ་འཛིན་མཛེས་པ་ཡོད། །
en: In the center of the glorious king of the waters Is beautiful Potalaka, king of mountains, the residence of heroes.

source: རིན་ཆེན་རྒྱུས་བྱས་ཤིང་དང་ནགས་ཚལ་མེ་ཏོག་མང་། །བཟའ་ཤིང་ར་བ་རྫིང་དང་ཆུ་བྲན་འབབ་པར་ལྡན། །
en: It has excellent trees made of jewels, is covered with flowers, And is endowed with parks, lotus ponds, and flowing streams.

source: རི་མཆོག་དེ་ལ་བརྟན་པར་སྤྱན་རས་གཟིགས་ཀྱི་དབང་། །འགྲོ་བ་རྣམས་ལ་ཕན་པའི་དོན་དུ་རྣམ་པར་སྤྱོད། །
en: “Wise Avalokiteśvara who benefits beings— That resolute one dwells on that supreme mountain.

source: དེའི་གན་སོང་དང་ནོར་བཟངས་ཁྱོད་ལ་མགོན་པོ་ཡིས། །ཡོན་ཏན་རྒྱ་ཆེན་ཚུལ་ལ་འཇུག་པ་སྟོན་པར་བྱེད། །
en: Go to him, Sudhana, and you will be taught The qualities of the Guides, the entry into the way of vast goodness.”

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་ཁྱིམ་བདག་ནན་ཁུགས་ཀྱི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ནས། ཁྱིམ་བདག་ནན་ཁུགས་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ཏེ། ཡང་དང་ཡང་བལྟས་ནས་ཁྱིམ་བདག་ནན་ཁུགས་ཀྱི་དྲུང་ནས་སོང་ངོ་།། །།སངས་རྒྱས་རྨད་གཅད་ཅེས་བྱ་བ་ཤིན་ཏུ་རྒྱས་པ་ཆེན་པོའི་མདོ།། བམ་པོ་ལྔ་པ། །
en: Then Sudhana, the head merchant’s son, bowed his head to the feet of the householder Veṣṭhila, circumambulated the householder Veṣṭhila many hundreds of thousands of times, keeping him to his right, and, looking back again and again, departed from the householder Veṣṭhila.

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཁྱིམ་བདག་ནན་ཁུགས་ཀྱི་གདམས་ངག་རྗེས་སུ་སེམས་ཤིང་། བྱང་ཆུབ་སེམས་དཔའི་མོས་པའི་མཛོད་དེ་ནི་ཤེས་པར་བྱེད། བྱང་ཆུབ་སེམས་དཔའི་རྗེས་སུ་དྲན་པའི་སྟོབས་དེ་ནི་རྗེས་སུ་དྲན་པར་བྱེད། སངས་རྒྱས་ཀྱི་ཚུལ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པའི་སྟོབས་ནི་ཡང་དག་པར་འཛིན། སངས་རྒྱས་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པའི་མཚམས་ནི་ཁོང་དུ་ཆུད་པར་བྱེད། རྣས་ཐོས་པའི་སངས་རྒྱས་ཀྱི་མཚན་དེ་དག་གི་རྗེས་སུ་ནི་འབྲང་། སངས་རྒྱས་ཀྱི་ཆོས་བསྟན་པའི་ཚུལ་དེ་དང་ནི་འཐུན་པར་བྱེད། སངས་རྒྱས་ཀྱིས་ཡང་དག་པར་བསྒྲུབ་པའི་རྒྱན་དེ་ནི་ཁོང་དུ་ཆུད་པར་བྱེད། སངས་རྒྱས་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བའི་ཁྱུ་མཆོག་གི་མཐུ་ཕྱུང་བ་དེ་ལ་ནི་ཡིད་ཆེས་པར་བྱེད། དེ་བཞིན་གཤེགས་པའི་ཕྲིན་ལས་བསམ་གྱིས་མི་ཁྱབ་པ་དེ་ནི་མངོན་དུ་བྱེད་ཅིང་།
en: Avalokiteśvara Chapter 30 Then Sudhana, the head merchant’s son, contemplating the instruction of the householder Veṣṭhila, knowing that treasury of bodhisattva aspiration, remembering that power of bodhisattva memory, keeping in his mind the power of that successive lineage of the way of the buddhas, comprehending the continuous succession of the lineage of the buddhas, remembering the names of the buddhas that he had heard, being in accord with the way of the Dharma taught by the buddhas, comprehending the array of attainments through the Dharma of the buddhas, having confidence in the proclamation of complete buddhahood by the buddhas, and focused on the inconceivable activity of the tathāgatas, eventually came to the Potalaka Mountain.

source: མཐར་གྱིས་རི་གྲུ་འཛིན་གང་ན་བ་དེར་སོང་ནས། རི་གྲུ་འཛིན་གྱི་སྟེང་དུ་ཕྱིན་ཏེ། བྱང་ཆུབ་སེམས་དཔའི་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་ཡོངས་སུ་རྨེད་ཅིང་ཚོལ་ཚོལ་བ་ལས།
en: He ascended the Potalaka Mountain and searched and searched for the bodhisattva Avalokiteśvara.

source: ནུབ་ཕྱོགས་ལོགས་ཀྱི་རིའི་སྨན་ལྗོངས་མཚོ་དང་།
en: He saw Avalokiteśvara on the upper slope of the western side of the mountain.

source: མཚེའུ་དང་འབབ་ཆུས་མཛེས་པར་གྱུར་པ། བཻཌཱུརྱ་སྔོན་པོའི་དཀྱིལ་འཁོར་ལྟར་སྔོ་ཞིང་འཇམ་ལ་གཞོན་པའི་སྤང་། ནགས་ཚལ་ཆེན་པོའི་མཐོངས་ན་འདུག་པ་ཞིག་ན།
en: It was a fresh, gentle, verdant pasture like a circular area of blue beryl and was beautified by springs, waterfalls, and streams, an open grove within a great forest.

source: རིན་པོ་ཆེའི་རྡོ་རྗེའི་རྡོ་སྟེགསཤིག་ལ་སྐྱིལ་མོ་ཀྲུང་བཅས་ཏེ་འདུག་ཅིང་། རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་རྡོ་སྟེགས་ལ་འཁོད་པའི་བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་དཔག་ཏུ་མེད་པས། ཀུན་ནས་བསྐོར་ཅིང་ཆོས་སྟོན་ཏེ།
en: He was teaching the Dharma, seated cross-legged upon a diamond rock encircled by a countless assembly of bodhisattvas seated upon rocks that were various jewels.

source: ཆོས་ཀྱི་རྣམ་གྲངས་འགྲོ་བ་ཐམས་ཅད་ཡོངས་སུ་སྡུད་པའི་ཡུལ་བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོའི་སྒོ་གསལ་བར་སྟོན་པ་ཞེས་བ་བ་ཡང་དག་པར་སྟོན་ཅིང་འདུག་པ་མཐོང་ངོ་། །
en: He was giving the Dharma teaching called The Clear Teaching of the Gateway to Love and Compassion, which has as its scope the gathering of all beings into the Dharma.

source: མཐོང་ནས་ཀྱང་དགའ་རངས་ཏེ་མགུ་ཞིང་ཉམས་བདེ་ལ་ཚིམ་ཞིང་ཡིད་བདེ་བ་སྐྱེས་ནས་དགའ་བས་རྒྱས་ཞིང་མི་འཛུམ་པའི་མིག་གིས་ཐལ་མོ་སྦྱར་ནས།
en: On seeing him, Sudhana was filled with joy, delighted, elated, pleased, and happy. With increasing rapture, he kept his eyes wide open. He placed his hands together in homage.

source: དགེ་བའི་བཤེས་གཉེན་ལ་དད་པའི་ཤུགས་དང་ལྡན་པས་སེམས་མི་འཁྲུག་པ།
en: His mind was at peace through being endowed with the power of faith in kalyāṇamitras.

source: དགེ་བའི་བཤེས་གཉེན་མཐོང་ན། སངས་རྒྱས་ཐམས་ཅད་མཐོང་བར་འཛིན་པ།
en: He believed that to see kalyāṇamitras was to see all the buddhas.

source: དགེ་བའི་བཤེས་གཉེན་ལས་བྱུང་བའི་ཆོས་ཀྱི་སྤྲིན་ཐམས་ཅད་ཡང་དག་པར་གཟུང་བའི་འདུ་ཤེས་དང་ལྡན་པ།
en: He believed that the acquisition of the entire cloud of Dharma originated from the kalyāṇamitras.

source: ཡོན་ཏན་དང་ནན་ཏན་ཐམས་ཅད་དགེ་བའི་བཤེས་གཉེན་ལ་རག་ལུས་པའི་འདུ་ཤེས་ཅན།
en: He believed that all qualities and practices depended on the kalyāṇamitras.

source: དགེ་བའི་བཤེས་གཉེན་དང་ཕྲད་པ་ཤིན་ཏུ་དཀའ་བར་སེམས་པ།
en: He believed that it was difficult to encounter kalyāṇamitras.

source: དགེ་བའི་བཤེས་གཉེན་ལས་སྟོབས་བཅུའི་ཡེ་ཤེས་རིན་པ་ཆེ་འབྱུང་ཞིང་ཐོབ་པར་འགྱུར་བའི་འདུ་ཤེས་དང་ལྡན་པ།
en: He believed that the attainment of the precious wisdom of the ten strengths came from the kalyāṇamitras.

source: དགེ་བའི་བཤེས་གཉེན་ལས་སྣང་བ་མི་ཟད་པ་འབྱུང་བའི་འདུ་ཤེས་ཅན།
en: He believed that the inexhaustible light of wisdom came from the kalyāṇamitras.

source: དགེ་བའི་བཤེས་གཉེན་གྱི་རྟེན་གྱི་བསོད་ནམས་ཀྱི་རྒྱུད་རྣམ་པར་འཕེལ་བར་འགྱུར་བའི་འདུ་ཤེས་དང་ལྡན་པ།
en: He believed that the continuous increase of merit was dependent on the kalyāṇamitras.

source: དགེ་བའི་བཤེས་གཉེན་ནི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་སྒོ་ཡང་དག་པར་སྟོན་པའི་འདུ་ཤེས་དང་ལྡན་པ།
en: He believed that the gateway to omniscience was revealed by the kalyāṇamitras.

source: དགེ་བའི་བཤེས་གཉེན་ནི་ཡེ་ཤེས་ཀྱི་རྒྱ་མཚོ་ཆེན་པོ་ལ་འཇུག་པའི་ཡོངས་སུ་སྟོན་པར་འདུ་ཤེས་པ།
en: He believed that entry into the great ocean of wisdom was taught by the kalyāṇamitras.

source: དགེ་བའི་བཤེས་གཉེན་ནི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཚོགས་ཡང་དག་པར་འདུས་པ། ཡོངས་སུ་བསྐྱེད་པའི་འདུ་ཤེས་དང་ལྡན་པ་དེ།
en: He believed that the gathering of the accumulation of omniscience was born from the kalyāṇamitras.

source: བྱང་ཆུབ་སེམས་དཔའ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་གང་ན་བ་དེར་ཕྱིན་ཏོ། །
en: He went toward the bodhisattva Avalokiteśvara.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་རིང་ཞིག་ནས་ཚུར་འོང་བ་མཐོང་ནས། སྨྲས་པ། ཚུར་ཤོག་དཔེ་མེད་པའི་ཐེག་པ་ཆེན་པོ་ཡངས་ཤིང་བསམ་གྱིས་མི་ཁྱབ་པ་ལ་ཞུགས་པ། སྐྱེ་བ་ལས་བྱུང་བའི་སྡུག་བསྔལ་སྣ་ཚོགས་ཀྱིས་གཙེས་ཤིང་སྐྱབས་མེད་པར་གྱུར་པའི་འགྲོ་བ་ཐམས་ཅད་ཡོངས་སུ་བསྐྱབ་པའི་བསམ་པ་དང་ལྡན་པ། སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་མངོན་སུམ་དུ་གྱུར་པ། འཇིག་རྟེན་ཐམས་ཅད་ལས་འདས་ཏེ་དཔེ་མེད་ཚད་མེད་པ་ལ་མངོན་པར་མོས་པ། སྙིང་རྗེ་ཆེན་པོས་བྱིན་གྱིས་བརླབས་པས། འགྲོ་བ་ཐམས་ཅད་ཡོངས་ས་བསྐྱབ་པའི་བློ་གྲོས་ཅན། བལྟ་ན་ཀུན་ཏུ་བཟང་པོའི་སྤྱོད་པ་ལ་མངོན་དུ་བལྟས་པ།
en: The bodhisattva Avalokiteśvara could see Sudhana, the head merchant’s son, coming in the distance and said, “Come here!

source: སྨོན་ལམ་ཆེན་པོའི་དཀྱིལ་འཁོར་ཡོངས་སུ་སྦྱང་བའི་སེམས་དང་ལྡན་པ། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་སྤྲིན་ཡོངས་སུ་གཟུང་བར་མོས་པ། དགེ་བའི་རྩ་བ་བསྩགས་པས་ངོམས་མི་ཤེས་པའི་བསམ་པ་དང་ལྡན་པ། དགེ་བའི་བཤེས་གཉེན་གྱི་གདམས་ངག་ལ་ཡང་དག་པར་ཞུགས་པ། འཇམ་དཔལ་གྱི་ཡེ་ཤེས་རྒྱ་མཚོ་ལས་བྱུང་བའི་ཡོན་ཏན་གྱི་འབྱུང་གནས་སངས་རྒྱས་ཀྱི་བྱིན་གྱི་རླབས་ཐོབ་པར་བྱ་བ་ལ་མངོན་དུ་བལྟས་པ། ཏིང་ངེ་འཛིན་གྱི་སྣང་བ་དང་ཤུགས་རབ་ཏུ་ཐོབ་པ། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་ཡང་དག་པར་གཟུང་བ་ལ་མངོན་པར་མོས་པའི་སེམས་དང་ལྡན་པ། སངས་རྒྱས་མཐོང་བས་དགའ་བ་དང་། མོས་པའི་ཤུགས་ཀྱིས་ཡིད་རབ་ཏུ་བདེ་བར་གྱུར་པ། ལེགས་པར་སྤྱོད་པ་ཚད་མེད་ཅིང་བསམ་གྱིས་མི་ཁྱབ་པའི་ཤུགས་ཀྱིས་མངོན་པར་བརླན་པའི་སེམས་དང་ལྡན་པ། ཡོན་ཏན་ལ་ནན་ཏན་དུ་བྱ་བའི་ཤུགས་ཀྱིས་རྣམ་པར་དག་པའི་བསོད་ནམས་དང་ཡེ་ཤེས་ཀྱི་མཛོད་བདག་ལ་མངོན་དུ་གྱུར་པ། ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་མཐོང་བའི་ལམ་གྱི་ཤུགས་གཞན་ལ་ཡོངས་སུ་བསྟན་པའི་བསམ་པ་ཅན། སྙིང་རྗེ་ཆེན་པོའི་ཤུགས་མ་ཉམས་པའི་རྩ་བ་དང་ལྡན་པ།
en: You are welcome, you who have entered the inconceivable, vast Mahāyāna, which is beyond any analogy; you who have the motivation to be a refuge for all beings who are tormented by various sufferings that arise through being born and who have no refuge; you who wish to witness all the Dharmas of the buddhas, which transcend the world, are beyond analogy, and are beyond measure; you who are filled with the power of great compassion and intend to liberate all beings; you in whom the completely good conduct is evidently seen; you who aspire to make pure a domain of great prayers; you who wish to possess the clouds of Dharma of all the buddhas; you whose motivation to accumulate roots of merit is never satisfied; you who follow perfectly the instructions of kalyāṇamitras; you who are the source of a lotus of good qualities, arising from the ocean of the wisdom of Mañjuśrī; you who are focused on attaining the blessing of the buddhas; you who have attained the light and power of samādhi; you who aspire to obtain the rain from the clouds of Dharma of all the buddhas; you whose mind is made happy by the power of faith and delight on seeing the buddhas; you whose mind is moistened by the power of immeasurable, inconceivable conduct; you who have become the lord of a treasure of pure merit and wisdom through the power of the practice of good qualities; you who are motivated to teach others the power of the path to seeing omniscient wisdom; you who possess the root that is the undiminishing power of great compassion; you who are intent on possessing the power of the light of the wisdom of the tathāgatas.”

source: དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་སྣང་བའི་ཤུགས་ཡང་དག་པར་གཟུང་བའི་བློ་གྲོས་ཅན་ཁྱོད་འོངས་པ་ལེགས་སོ་ལེགས་སོ། །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་བྱང་ཆུབ་སེམས་དཔའ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་གདན་པ་དེར་སོང་ནས།
en: Then Sudhana, the head merchant’s son, approached the bodhisattva Avalokiteśvara.

source: བྱང་ཆུབ་སེམས་དཔའ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ།
en: He bowed his head to the feet of the bodhisattva Avalokiteśvara.

source: བྱང་ཆུབ་སེམས་དཔའ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས་མདུན་དུ་འདུག་སྟེ།
en: He circumambulated the bodhisattva Avalokiteśvara many hundreds of thousands of times, keeping him to his right.

source: ཐལ་མོ་སྦྱར་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །འཕགས་པ་བདག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ན། ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བགྱི་བ་མ་འཚལ་ཏེ།
en: Then he stood before him and, with his hands placed together in homage, said, “Ārya, I have developed the aspiration for the highest, complete enlightenment, but I do not know how bodhisattvas should train in bodhisattva conduct and in what way they should practice it.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོས་མདོག་འཛམ་བུ་ཆུ་ཀླུང་གི་གསེར་གྱི་ཁ་དོག་ཏུ་འདུག་པ་འོད་ཀྱི་དྲ་བ་རྣམ་པ་སྣ་ཚོགས་ཚད་མེད་པ་འཕྲོ་བའི་རྒྱན་གྱི་སྤྲིན་རབ་ཏུ་འགྱེད་པའི་ལག་པ་གཡས་པ་བརྐྱང་ཏེ། མཚན་དང་དཔེ་བྱད་བཟང་པོ་ལས་བྱུང་བའི་འོད་གཟེར་སྣ་ཚོགས་དྲི་མ་མེད་པ། ལུས་དང་སེམས་ཀྱི་བདེ་བ་ཚད་མེད་པ་རབ་ཏུ་སྐྱེད་པའི་ཚོགས་ཀྱིས་ཤིན་ཏུ་རྒྱས་པའི་ལག་པ། ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱི་སྤྱི་བོ་ལ་བཞག་སྟེ།
en: Then the bodhisattva Avalokiteśvara extended his right hand, which was the color of gold from the Jambu River and emanated a display of clouds of countless networks of lights of various colors, and upon Sudhana’s head he placed his hand, which had the multicolored light rays that shine from the signs and features of a great being and bring stainless, measureless physical and mental bliss.

source: འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་དེ་ལྟར་ཁྱོད་ཀྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་ལེགས་སོ་ལེགས་སོ། །
en: The bodhisattva Avalokiteśvara said, “Noble one, it is excellent, excellent, that you have in that way developed the aspiration for the highest, complete enlightenment!

source: རིགས་ཀྱི་བུ་ང་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་སྒོ་སྙིང་རྗེ་ཆེན་པོའི་སྒོ་ཐོགས་པ་མེད་པ་ཞེས་བྱ་བ་ཤེས་ཏེ།
en: “Noble one, I know the gateway to bodhisattva activity called the unimpeded gateway to great compassion.

source: རིགས་ཀྱི་བུ་ང་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་སྒོ་སྙིང་རྗེ་ཆེན་པོའི་སྒོ་ཐོགས་པ་མེད་པ་དེ་ནི་འགྲོ་བ་ཐམས་ཅད་ལ་དབྱེ་བ་མེད་པར་སེམས་ཅན་ཡོངས་སུ་སྨྱིན་པར་བྱ་བ་དང་། གདུལ་བ་ལ་ཞུགས་པ་སྒོ་ཀུན་ནས་ཐོས་ཤིང་རྣམ་པར་རིག་པར་འགྱུར་བས། སེམས་ཅན་ཡོངས་སུ་བསྡུ་བ་དང་།
en: “Noble one, my gateway to bodhisattva activity called the unimpeded gateway to great compassion ripens and guides beings without making any distinctions among all beings, and it gathers and guides beings through their completely hearing and knowing this gateway.

source: གདུལ་བ་ལ་ཉེ་བར་གནས་པ་སྟེ། རིགས་ཀྱི་བུ་དེ་ལྟར་ང་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་སྒོ་སྙིང་རྗེ་ཆེན་པོའི་སྒོ་ཐོགས་པ་མེད་པ་ལ་གནས་པས། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཞབས་ཀྱི་དྲུང་ནས་ཀྱང་མི་གཡོ་ལ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་དགོས་པ་ལའང་སྟ་གོན་དུ་གནས་ཏེ།
en: “Noble one, in that way, being established in the gateway to bodhisattva activity called the unimpeded gateway to great compassion, though I never depart from being at the feet of all the tathāgatas, I remain focused on what should be done for all beings.

source: སྦྱིན་པས་ཀྱང་སེམས་ཅན་ཡོངས་སུ་སྡུད་དོ། །
en: I gather beings through generosity.

source: ངག་སྙན་པ་དང་དོན་བྱ་བ་དང་། དོན་འཐུན་པས་ཀྱང་སེམས་ཅན་ཡོངས་སུ་བསྡུད་དོ། །
en: I gather beings through pleasant words, through benefiting them, and through practicing what I teach.

source: གཟུགས་ཀྱི་ལུས་རྣམ་པར་བསྟན་པས་ཀྱང་། སེམས་ཅན་ཡོངས་སུ་སྨྱིན་པར་བྱེད་དོ། །
en: “I also ripen beings through manifesting physical bodies.

source: ཁ་དོག་དང་དབྱིབས་དང་གཟུགས་བསམ་གྱིས་མི་ཁྱབ་པ་བསྟན་ཏེ། རྣམ་པར་དམིགས་པར་བྱ་བ་དང་། འོད་གཟེར་ཀྱི་དྲ་བ་དགྱེ་བས་ཀྱང་སེམས་ཅན་རབ་ཏུ་ཚིམ་པར་བྱེད་ཅིང་ཡོངས་སུ་སྨྱིན་པར་བྱེད་དོ། །
en: I gladden and ripen beings through manifesting countless pure colors, shapes, and forms and through radiating a net of light rays.

source: བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་དབྱངས་བརྗོད་པ་དང་།
en: I speak to them in accordance with their aspirations.

source: ཅི་ལ་དགའ་བའི་སྤྱོད་ལམ་ཡོངས་སུ་བསྟན་པ་དང་།
en: I manifest whatever path of conduct they delight in.

source: མོས་པ་སྣ་ཚོགས་དང་། ཚུལ་འཐུན་པར་ཆོས་བསྟན་པ་དང་།
en: I teach them the Dharma in accordance with their various wishes.

source: རྫུ་འཕྲུལ་དང་རྣམ་པར་འཕྲུལ་པ་སྣ་ཚོགས་དང་། དགེ་བའི་ཆོས་བསྩགས་པར་བག་མྱི་བྱེད་པའི་སེམས་ཅན་གྱི་སེམས་ཡོངས་སུ་བསྐུལ་བ་དང་།
en: I manifest various forms of miracles so as to inspire beings who have not been attentive in accumulating virtuous qualities.

source: བསམ་པ་དང་འཐུན་པར་སྤྲུལ་པ་སྣ་ཚོགས་ཚད་མེད་པ་ཡོངས་སུ་བསྟན་པ་དང་།
en: I manifest a variety of countless emanations in accordance with their wishes.

source: རིགས་སྣ་ཚོགས་སུ་སྐྱེས་པའི་སེམས་ཅན་རྣམས་དང་སྐལ་བ་འཐུན་པའི་གཟུག་ཡོངས་སུ་བསྟན་པ་དང་། གནས་གཅིག་ཏུ་འགྲོགས་པས་ཀྱང་སེམས་ཅན་ཡོངས་སུ་བསྡུས་ཤིང་ཡོངས་སུ་སྨྱིན་པར་བྱེད་དོ། །
en: I gather and ripen beings by manifesting forms that accord with the states of the beings born in the various classes of existence and by living with them in the same place.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ངས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་སྒོ་སྙིང་རྗེ་ཆེན་པོའི་སྒོ་ཐོགས་པ་མེད་པ་འདི་ཡོངས་སུ་སྦྱངས་པས། འགྲོ་བ་ཐམས་ཅད་རབ་ཏུ་རྟེན་པའི་སྨོན་ལམ་བསྐྱེད་དེ། འདི་ལྟར་སེམས་ཅན་ཐམས་ཅད་ཀྱི་གཡང་སའི་འཇིགས་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་རྒྱུད་ཀྱི་འཇིགས་པ་ཞི་བར་བྱ་བ་དང་།
en: “Noble one, in that way I have purified the gateway to bodhisattva activity called the unimpeded gateway to great compassion and therefore prayed to be a support for all beings.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་མགོ་རྨོངས་པའི་འཇིགས་པ་རྣམ་པར་བཟློག་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་བཅིངས་པའི་འཇིགས་པ་ཡོངས་སུ་གཅད་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྲོག་ལ་བབ་པར་མི་བདེ་བའི་འཇིགས་པ་རྣམ་པར་བཟློག་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཡོ་བྱད་ཀྱིས་ཕོངས་པའི་འཇིག་པ་བསལ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་འཚོ་བ་མེད་པའི་འཇིགས་པ་ཞི་བར་བྱ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་གྲགས་པ་མེད་པའི་འཇིག་རྟེན་པ་ལས་ཡོངས་སུ་བཟླ་བ་དང་།
en: I have accomplished the prayer to be a support for all beings in order that I end for all beings the fear of precipices, cause fears within all beings to cease, eliminate fear from confusion in all beings, eliminate in all beings the fear of being in bondage, dispel in all beings the fear of circumstances that cause loss of life, banish from all beings the fear of being deprived of material necessities, end in all beings the fear of being without a livelihood, dispel in all beings the fear of ill repute, dispel in all beings the fear of being in saṃsāra, cause the fear of timidity within an assembly to cease in all beings, cause all beings to transcend the fear of death, dispel in all beings the fear of the lower existences, shine the light of irreversibility upon those whose path has degenerated in great darkness, completely eliminate in all beings the fear of meeting misfortune, extinguish in all beings the fear of being apart from what is liked, eliminate in all beings the fear of having to be with what is disliked, separate all beings from the fear of physical torment, free all beings from mental torment, and cause all beings to transcend suffering, unhappiness, and disturbances.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་འཁོར་བའི་འཇིགས་པ་རབ་ཏུ་ཞི་བར་བྱ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་འཁོར་དུ་བག་ཚ་བའི་འཇིགས་པ་མེད་པར་བྱ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་འཆི་བའི་འཇིགས་པ་ལས་རྣམ་པར་བཟླ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ངན་སོང་གི་འཇིགས་པ་རྣམ་པར་བཟློག་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལམ་མུན་པས་ཉམ་ང་བ་ཕྱིར་མི་ལྡོག་པའི་སྣང་བས་གསལ་བར་བྱ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་སྐལ་བ་མི་མཉམ་པ་དང་འགྲོགས་པའི་འཇིགས་པ་ཤིན་ཏུ་བསལ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྡུག་པ་དང་བྲལ་བའི་འཇིགས་པ་དགག་པར་བྱ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་མི་སྡུག་པ་དང་། འགྲོགས་པའི་འཇིགས་པ་མེད་པར་བྱ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ལུས་ལ་མི་བདེ་བའི་འཇིགས་པ་དང་བྲལ་བར་བྱ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་སེམས་ལ་མི་བདེ་བའི་འཇིགས་པ་ལས་དགྲོལ་བ་དང་།
en: “I manifest the gateway to mindfulness in all worlds in order to dispel fear in all beings.

source: སེམས་ཅན་ཐམས་ཅད་སྡུག་བསྔལ་བ་དང་། ཡིད་མི་བདེ་བ་དང་འཁྲུགས་པ་ལས་ཡོངས་སུ་བཟླ་བའི་ཕྱིར་འགྲོ་བ་ཐམས་ཅད་རབ་ཏུ་རྟེན་པའི་སྨོན་ལམ་མངོན་པར་བསྒྲུབ་པ་འདི་བྱས་སོ། །སེམས་ཅན་ཐམས་ཅད་ཀྱི་འཇིགས་པ་རྣམ་པར་ཞི་བར་བྱ་བའི་ཕྱིར་ཡང་འཇིག་རྟེན་དུ་རྗེས་སུ་དྲན་པའི་སྒོ་བྱིན་གྱིས་བརླབས་སོ། །སེམས་ཅན་ཐམས་ཅད་འཇིགས་པ་དང་བྲལ་བར་བྱ་བའི་ཕྱིར། རང་གི་མྱིང་འཁོར་ལོ་ཡང་འཇིག་རྟེན་དུ་རྣམ་པར་དམིགས་པར་བྱས་སོ། །
en: I have made the wheel of my name known in all worlds in order to free all beings from fear.

source: དུས་ཇི་ལྟ་བ་བཞིན་དུ་འགྲོ་བས་རྣམ་པར་དམྱིགས་པར་བྱ་བའི་ཕྱིར་འགྲོ་བ་ཐམས་ཅད་ཀྱི་རྣམ་པའི་བྱེ་བྲག་མཐའ་ཡས་པ་དང་མཉམ་པར་ངའི་ལུས་ཀྱང་བྱིན་གྱིས་བརླབས་སོ། །
en: I miraculously manifest my body to be the same as the distinct forms of all endless beings in order to be perceived by beings at the appropriate times.
